Tekla.Structures.Model.SharingResultCode
Represents the result code for a sharing operation.

Tekla.Structures.Model.SharingResultCode.OK
The operation completed successfully.

Tekla.Structures.Model.SharingResultCode.ANOTHER_OPERATION_IN_PROGRESS
Another operation is already in progress.

Tekla.Structures.Model.SharingResultCode.CANCELLED
The operation is cancelled by user.

Tekla.Structures.Model.SharingResultCode.WRITE_OUT_RESERVED
Write out is reserved by a user who is not the current user.

Tekla.Structures.Model.SharingResultCode.READ_IN_REQUIRED_BEFORE_WRITE_OUT
The service has versions newer than the last read-in. They should be read-in before writing out.

Tekla.Structures.Model.SharingResultCode.MODEL_DOES_NOT_EXIST
A model with the specified id doen not exist on the service, or the current user is not invited to the model.

Tekla.Structures.Model.SharingResultCode.NO_PERMISSION
The request operation is not permitted for the current user.

Tekla.Structures.Model.SharingResultCode.WRITEOUT_DATA_FOLDER_CREATION_FAILED
The write out temporary folder could not be created.

Tekla.Structures.Model.SharingResultCode.WRITEOUT_ZIP_CREATION_FAILED
The write out version packet could not be compressed.

Tekla.Structures.Model.SharingResultCode.JOIN_FAILED_FOLDER_EXISTS
The requested join folder already exists.

Tekla.Structures.Model.SharingResultCode.SAVE_FAILED
Saving the model failed because of reasons internal to Tekla Structures.

Tekla.Structures.Model.SharingResultCode.FILE_BUSY
The operation failed because a file was opened in another program. If Tekla.Structures.Model.ISharingResult.ErrorPath is set, it contains the file path.

Tekla.Structures.Model.SharingResultCode.MODEL_FOLDER_PATH_TOO_LONG
The operation failed because the model folder path is too long. If Tekla.Structures.Model.ISharingResult.ErrorPath is set, it contains the folder path, and Tekla.Structures.Model.ISharingResult.PathLengthLimit contains the maximum allowed length.

Tekla.Structures.Model.SharingResultCode.TEMP_FOLDER_PATH_TOO_LONG
The operation failed because the temporary folder path is too long. If Tekla.Structures.Model.ISharingResult.ErrorPath is set, it contains the folder path, and Tekla.Structures.Model.ISharingResult.PathLengthLimit contains the maximum allowed length.

Tekla.Structures.Model.SharingResultCode.FILE_PATH_TOO_LONG
The operation failed because a file path is too long. If Tekla.Structures.Model.ISharingResult.ErrorPath is set, it contains the file path, and Tekla.Structures.Model.ISharingResult.PathLengthLimit contains the maximum allowed length.

Tekla.Structures.Model.SharingResultCode.FOLDER_CREATION_ERROR
The operation failed because a folder could not be created. If Tekla.Structures.Model.ISharingResult.ErrorPath is set, it contains the folder path.

Tekla.Structures.Model.SharingResultCode.FILE_COPY_ERROR
The operation failed because a file could not be copied. If Tekla.Structures.Model.ISharingResult.ErrorPath is set, it contains the file path.

Tekla.Structures.Model.SharingResultCode.DISK_FULL
There is not enough disk space to complete the operation safely. Note that due to complexity of the operations, actual space requirements may be hard to predict, so the checks may make mistakes to either side.

Tekla.Structures.Model.SharingResultCode.UNPERMITTED_WRITE_OUT_CHANGES
Unallowed model changes exist. The current user's role needs to be elevated or you need to join again to work with this model.

Tekla.Structures.Model.SharingResultCode.DATABASE_ERROR
The operation failed because or error in database operations.

Tekla.Structures.Model.SharingResultCode.NO_PACKETS_AVAILABLE_TO_READ_IN
Read in operation failed because the model is already up-to-date with latest service version.

Tekla.Structures.Model.SharingResultCode.MODEL_NOT_SHARED
The operation failed because the current model is not shared.

Tekla.Structures.Model.SharingResultCode.CODEPAGE_UTF8
The operation was stopped because the current system codepage is UTF-8, whic isn't supported in Tekla Structures.

Tekla.Structures.Model.SharingResultCode.LICENSE_CLOCK_SKEW
The operation was stopped because the system clock is incorrect. Correct clock settings are imporrtant for proper licensing.

Tekla.Structures.Model.SharingResultCode.LICENSE_NOT_GRANTED
The operation was stopped because the sharing license was not granted for the user's organisation.

Tekla.Structures.Model.SharingResultCode.LICENSE_QUOTA_EXCEEDED
The operation was stopped because the sharing license has exceeded its allowed quota.

Tekla.Structures.Model.SharingResultCode.LICENSE_EXPIRED
The operation was stopped because the license has expired.

Tekla.Structures.Model.SharingResultCode.LICENSE_DENIED
The operation was stopped because the license was denied for the user.

Tekla.Structures.Model.SharingResultCode.SERVICE_CONNECTION_FAILED
The operation failed because connection to a service or service operation failed.

Tekla.Structures.Model.SharingResultCode.ERROR
The operation encountered an unspecified error. Tekla.Structures.Model.ISharingResult.ErrorDetails and Tekla.Structures.Model.ISharingResult.Notifications may contain more information.